<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"a50165c4c1b19963e614dcb9659300f21c8da5044f2cd8b17b11e991eaabe71c","plan_job_ref":"Job CICD for Splitrr Infra #41 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10656173599","plan_out_hash":"55691ff556301175a7b681b8cbb1142e0ecbd9771670c2539ea3bc0d1adb6bd4","plan_hash":"9b34a8120b15d6660a4e76aa46d02033cd757603cbbc179c005013936b1799b6","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 9 to add, 4 to change, 6 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.alb.aws_alb_listener.https_listener will be updated in-place
!~  resource "aws_alb_listener" "https_listener" {
!~      certificate_arn   = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-east-1:949263681218:listener/app/splitrr-dev-alb/d90f6e3a090c1465/706bca90056828ea"
        tags              = {
            "Name" = "splitrr-dev-alb-https-listener"
        }
#        (6 unchanged attributes hidden)

!~      default_action {
#            (3 unchanged attributes hidden)

!~          fixed_response {
!~              message_body = "forbidden" -> "Not Found"
!~              status_code  = "403" -> "404"
#                (1 unchanged attribute hidden)
            }
        }

#        (1 unchanged block hidden)
    }

  # module.alb_acm.aws_acm_certificate.acm_certificate must be replaced
+/- resource "aws_acm_certificate" "acm_certificate" {
!~      arn                       = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d" -> (known after apply)
!~      domain_validation_options = [
-           {
-               domain_name           = "api.dev.bibek65.tech"
-               resource_record_name  = "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech."
-               resource_record_type  = "CNAME"
-               resource_record_value = "_3fe0d2ad07dcba2e03cd1f7ecbcd8c9c.djqtsrsxkq.acm-validations.aws."
            },
-           {
-               domain_name           = "app.dev.bibek65.tech"
-               resource_record_name  = "_c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech."
-               resource_record_type  = "CNAME"
-               resource_record_value = "_b279fe69b90a7a78590cf58998c74261.djqtsrsxkq.acm-validations.aws."
            },
-           {
-               domain_name           = "dev.bibek65.tech"
-               resource_record_name  = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech."
-               resource_record_type  = "CNAME"
-               resource_record_value = "_74072d5ad85d16f715a121df19ecc774.djqtsrsxkq.acm-validations.aws."
            },
+           {
+               domain_name           = "api.dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
!~      id                        = "***********************************************************************************" -> (known after apply)
!~      key_algorithm             = "********" -> (known after apply)
!~      not_after                 = "2025-09-30T23:59:59Z" -> (known after apply)
!~      not_before                = "2024-09-01T00:00:00Z" -> (known after apply)
!~      pending_renewal           = false -> (known after apply)
!~      renewal_eligibility       = "ELIGIBLE" -> (known after apply)
!~      renewal_summary           = [] -> (known after apply)
!~      status                    = "ISSUED" -> (known after apply)
!~      subject_alternative_names = [ # forces replacement
-           "app.dev.bibek65.tech",
#            (2 unchanged elements hidden)
        ]
        tags                      = {
            "Name" = "splitrr-dev-alb-acm"
        }
!~      type                      = "AMAZON_ISSUED" -> (known after apply)
!~      validation_emails         = [] -> (known after apply)
#        (5 unchanged attributes hidden)

!~      options {
+           arn                       = (known after apply)
+           certificate_authority_arn = (known after apply)
+           certificate_body          = (known after apply)
+           certificate_chain         = (known after apply)
+           domain_name               = (known after apply)
+           domain_validation_options = (known after apply)
+           early_renewal_duration    = (known after apply)
+           id                        = (known after apply)
+           key_algorithm             = (known after apply)
+           not_after                 = (known after apply)
+           not_before                = (known after apply)
+           pending_renewal           = (known after apply)
+           private_key               = (known after apply)
+           renewal_eligibility       = (known after apply)
+           renewal_summary           = (known after apply)
+           status                    = (known after apply)
+           subject_alternative_names = (known after apply)
+           tags                      = (known after apply)
+           tags_all                  = (known after apply)
+           type                      = (known after apply)
+           validation_emails         = (known after apply)
+           validation_method         = (known after apply)
        } -> (known after apply)
    }

  # module.alb_acm.aws_acm_certificate_validation.acm_certificate_validation must be replaced
+/- resource "aws_acm_certificate_validation" "acm_certificate_validation" {
!~      certificate_arn         = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d" # forces replacement -> (known after apply) # forces replacement
!~      id                      = "*****************************" -> (known after apply)
!~      validation_record_fqdns = [ # forces replacement
-           "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech",
-           "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech",
-           "_c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech",
        ] -> (known after apply) # forces replacement
    }

  # module.alb_acm.aws_route53_record.route53_record["api.dev.bibek65.tech"] must be replaced
+/- resource "aws_route53_record" "route53_record" {
!~      fqdn                             = "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech" -> (known after apply)
!~      id                               = "***********************************************************************************" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
!~      name                             = "_644c24a934c0c97acebf5828bd9c671d.api.dev.bibek65.tech" # forces replacement -> (known after apply) # forces replacement
!~      records                          = [
-           "_3fe0d2ad07dcba2e03cd1f7ecbcd8c9c.djqtsrsxkq.acm-validations.aws.",
        ] -> (known after apply)
!~      type                             = "CNAME" -> (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.alb_acm.aws_route53_record.route53_record["app.dev.bibek65.tech"] will be destroyed
  # (because key ["app.dev.bibek65.tech"] is not in for_each map)
-   resource "aws_route53_record" "route53_record" {
-       allow_overwrite                  = true -> null
-       fqdn                             = "_c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech" -> null
-       id                               = "Z021384721RGJE537TR9W__c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech._CNAME" -> null
-       multivalue_answer_routing_policy = false -> null
-       name                             = "_c4df8a908206e9f4c3665a11330fb7b8.app.dev.bibek65.tech" -> null
-       records                          = [
-           "_b279fe69b90a7a78590cf58998c74261.djqtsrsxkq.acm-validations.aws.",
        ] -> null
-       ttl                              = 60 -> null
-       type                             = "CNAME" -> null
-       zone_id                          = "Z021384721RGJE537TR9W" -> null
#        (2 unchanged attributes hidden)
    }

  # module.alb_acm.aws_route53_record.route53_record["dev.bibek65.tech"] must be replaced
+/- resource "aws_route53_record" "route53_record" {
!~      fqdn                             = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech" -> (known after apply)
!~      id                               = "*******************************************************************************" -> (known after apply)
-       multivalue_answer_routing_policy = false -> null
!~      name                             = "_4a66a25bd68527052b36abf9a84738b0.dev.bibek65.tech" # forces replacement -> (known after apply) # forces replacement
!~      records                          = [
-           "_74072d5ad85d16f715a121df19ecc774.djqtsrsxkq.acm-validations.aws.",
        ] -> (known after apply)
!~      type                             = "CNAME" -> (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.cloudfront.data.aws_iam_policy_document.origin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "origin" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::spiltrr-dev-bucket/*",
            ]
+           sid       = "1"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::949263681218:distribution/E2Y1XQZVO267IC",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.cloudfront.aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E2Y1XQZVO267IC"
        tags                            = {
            "Name" = "Cloud Front"
        }
#        (22 unchanged attributes hidden)

!~      viewer_certificate {
!~          acm_certificate_arn            = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d" -> (known after apply)
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # module.cloudfront.aws_s3_bucket_policy.origin will be updated in-place
!~  resource "aws_s3_bucket_policy" "origin" {
        id     = "spiltrr-dev-bucket"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "s3:GetObject"
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::949263681218:distribution/E2Y1XQZVO267IC"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = "arn:aws:s3:::spiltrr-dev-bucket/*"
-                       Sid       = "1"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.cloudfront_acm.aws_acm_certificate.acm_certificate will be created
+   resource "aws_acm_certificate" "acm_certificate" {
+       arn                       = (known after apply)
+       domain_name               = "dev.bibek65.tech"
+       domain_validation_options = [
+           {
+               domain_name           = "app.dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
+           {
+               domain_name           = "dev.bibek65.tech"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "app.dev.bibek65.tech",
+           "dev.bibek65.tech",
        ]
+       tags                      = {
+           "Name" = "splitrr-dev-cloudfront-acm"
        }
+       tags_all                  = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-cloudfront-acm"
+           "Project" = "Splitrr"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options (known after apply)
    }

  # module.cloudfront_acm.aws_acm_certificate_validation.acm_certificate_validation will be created
+   resource "aws_acm_certificate_validation" "acm_certificate_validation" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["app.dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = "*********************"
    }

  # module.cloudfront_acm.aws_route53_record.route53_record["dev.bibek65.tech"] will be created
+   resource "aws_route53_record" "route53_record" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = "*********************"
    }

  # module.ecs-ec2.data.aws_iam_policy_document.ecs_node_doc will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_node_doc" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.ecs-ec2.aws_iam_role.ecs_node_role will be updated in-place
!~  resource "aws_iam_role" "ecs_node_role" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
        name                  = "splitrr-dev-backend-ecs-ec2-node-role20240901163103903800000001"
        tags                  = {}
#        (11 unchanged attributes hidden)
    }

  # module.target_group.aws_lb_listener_certificate.alb_listener_certificate must be replaced
-/+ resource "aws_lb_listener_certificate" "alb_listener_certificate" {
!~      certificate_arn = "arn:aws:acm:us-east-1:949263681218:certificate/6016b782-65a8-4829-8015-6e37b0b3701d" # forces replacement -> (known after apply) # forces replacement
!~      id              = "******************************************************************************************************************************************************************************************************" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

Plan: 9 to add, 4 to change, 6 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #41](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10656173599)